'''
A,b 가 각각 순서대로 자기의 카드ㅡㄹ 보여준다
a랑 b랑 비교를 하면서 더 큰숫자가 있는 사람이 그 판에서 이긴것이다.

각 라운드는 더 높은 숫자를 제시한 사람이 승리하고, 제시한 숫자가 같은 경우는 비긴다

열 번의 라운드에서 더 많은 라운드를 승리한 사람이 게임을 승리하고, 승리한 라운드 횟수가 동일한 경우 비긴다.

***게임의 승패가 결정되는 경우 승리한 사람을 출력하고, 비기는 경우에는 D를 출력한다. 

-> 하나씩 돌려보ㅕㄴ서 만약에 a가 더 크면 a에 b가 더 크면b에 
    1을 더해가면서 가장 큰값ㅇㄹ출력한다

'''

A = [*map(int, input().split(' '))]
B = [*map(int, input().split(' '))]
An=[0,0]

for i in range(0,10):
    if A[i]>B[i]:
        An[0]+=1
    elif B[i]>A[i]:
        An[1]+=1
    elif A[i]==B[i]:
        continue

if An[0]>An[1]:
    print('A')
elif An[0]<An[1]:
    print('B')
elif An[0]==An[1]:
    print('D')

