'''
* 승부가 결정이 되지 않으면 0 으로 출력!!!!
 (1= 검은색 2= 흰색 0= 결정이 안됬을때)

입력을받아서 한씩 돌아서 본다.
8방향을 보고 만약 옆이 1이면 그리고 개수가 5개이면 된다.
하지만 여섯 알 이상이 연속적으로 놓인 경우에는 이긴 것이 아니다.

바둑알이 연속적으로 다섯 알을 놓이면 그 색이 이기게 된다.

단, 검은색과 흰색이 동시에 이기거나 검은색 또는 흰색이 두 군데 이상에서 동시에 이기는 경우는 입력으로 들어오지 않는다.

검은색이 이겼는지, 흰색이 이겼는지 또는 아직 승부가 결정되지 않았는지를 판단하는 프로그램을 작성하시오.

판의 크기= 19*19

가장 위에/ 처음에 있는거 좌표 프린트 (?)
'''
board=[]
for w in range(19):
    a= [*map(int, input().split(' '))]
    board.append(a)

dir = [[1, 0], [0, 1], [1, 1], [-1, 1], [-1, 0], [0, -1], [-1, -1], [1, -1]]
for i in range(19):
    for j in range(19):
        if board[i][j] == 0:
            continue 
        elif board[i][j] != 0:
            for p in range(8):
                y, x = i, j
                aa=0 #초기화가 잘못된곳에서 된다.
                print('aa')# 초기화가 언제 되는지 보기위햐=
                ab=0
                AN=[]
                for _ in range(19):
                    y = y + dir[p][0]# 좌표 움직이기(1)
                    x = x + dir[p][1]
                    ny = y + dir[p][0]
                    nx = x + dir[p][1]
                    if 0 <= y <=18 and 0 <= x <=18 and 0 <= nx <=18 and 0 <= ny <=18:
                        if board[y][x]!=0:
                            if board[y][x] == 1:
                                if board[y][x]==1 and board[ny][nx]==1:
                                    print(dir[p][0], dir[p][1], ny+1, nx+1,  y+1,x+1, aa, 1) # 좌표가 이동을 안한디
                                    #어디서 시작하는지 보기
                                    if aa==5:
                                        print(1)
                                        exit()
                                    elif aa!=5 :
                                        aa+=1
                                        i+=1
                                        j+=1
                                else: 
                                    break
                            elif board[y][x] == 2:
                                if board[y][x]==2 and board[ny][nx]==2:
                                    print(y+1,x+1,2)
                                    if ab==5:
                                        print(2)
                                        exit()
                                    elif ab!=5:
                                        ab+=1
                                else:
                                    break
'''
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 1 1 1 1 1 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
'''